/* 用户项目接口配置管理头文件
 * 存放在对应项目的 .\Core\Inc 路径下，不同项目只需配置本文件的接口定义即可
 * 对于STM32，外设初始化使用CubeMX配置，外设驱动(逻辑)写在User路径下(可存放在其他路径中，供不同项目使用时，包含User路径即可)，包括：
    +-----------------------------------------------------------------------------------------------------------------+
    | 中文名称 |        英文全称        | 英文缩写 |                            解释与示例                            |
    |----------|------------------------|----------|------------------------------------------------------------------|
    |   内核   |          core          |    co    |                      MCU核心本身，如ARM Core                     |
    |----------|------------------------|----------|------------------------------------------------------------------|
    | 片上外设 | intergrated peripheral |    in    |     与内核封装在同一芯片内的功能模块，如片上ADC、USART、TIM      |
    |----------|------------------------|----------|------------------------------------------------------------------|
    | 片外外设 |   external peripheral  |    ex    | 位于MCU芯片外部的设备或芯片，如外部FLASH、LED、LCD屏、传感器模块 |
    +-----------------------------------------------------------------------------------------------------------------+
 */

#ifndef __USER_PROJECT_CONF_H
#define __USER_PROJECT_CONF_H

/* ------------------------ 片上外设接口 ------------------------ */
/* 串口 */
#include "in_serial.h"
#define USARTx            USART1            /* 使用第几号串口 */
#define huartx            huart1            /* 所使用串口的句柄 */
#define hdma_usartx_rx    hdma_usart1_rx    /* DMA串口接收通道的句柄 */
#define USART_ISR         SR                /* USART的 状态寄存器SR */
#define USART_TDR         DR                /* USART的 发送数据寄存器TDR */


/* ------------------------ 片外外设接口 ------------------------ */
/* LED */
#include "ex_led.h"
#define EX_LED0_GPIOx         GPIOB
#define EX_LED0_GPIO_PIN_x    GPIO_PIN_2    /* IO置低电平，LED灭 */


#endif    /* __USER_PROJECT_CONF_H */
